Revit 2026 API

# FilterCategoryRuleSetCategories Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool SetCategories(
	ICollection<ElementId> categories
)
```
```vb
Public Function SetCategories (
	categories As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
bool SetCategories(
	ICollection<ElementId^>^ categories
)
```
```fsharp
member SetCategories :
        categories : ICollection<ElementId> -> bool
```

#### Parameters

categories ICollectionElementId

#### Return Value

Boolean

#### Reference

FilterCategoryRule Class

Autodesk.Revit.DB Namespace